<template>
  <div class="rule">
    <top-head>产品使用说明</top-head>
    <div class="content" v-html="content"></div>
  </div>
</template>

<script>
export default {
  components: {},
  data() {
    return {
      content: ""
    };
  },
  methods: {},
  created() {
    let content = `<-1.用户注册->

用户使用手机号码注册；为防止恶意注册，避免号贩子倒号现象，首先需要验证用户手机号码的真实性。系统会为用户手机上发送一个短信验证，验证通过后即可注册成功。



<-2.为什么要绑定支付宝？->

平台对用户的现金奖励都是通过支付宝进行实时分账，包括平台抽奖游戏，营销奖励，销售奖励，团队奖励等等。



<-3.商品价格波动的算法？->

价格波动说明：以24小时（1440分钟）为时间区间，计算任何时刻提货券价格。假定当前的前1440分钟平均价格P1，时间区间T1，T1之前1440分钟平均价格为P2,时间区间T2；那么当前价格P3=D1*0.5*T1销量/T2销量，D2不可为0，初始值1。

P3最低值为4，不设上限。



<-4.什么是平台股东？->

凡是在平台有成交记录的用户均为股东。



<-5.什么是虚拟股东？->

所有股东中的贡献值排名前10%用户作为虚拟股东（原始股东、节点股东除外），虚拟股东每分钟变化。



<-6.什么是贡献值？->

即价格*购买量。



<-7.什么是节点股东？->

基本节点为贡献值前24位客户（原始股东除外），可获得成为节点后贡献值的双倍积分。



<-8.积分系统->

用户通过自己、下级以及下下级成交，或者通过分享转发能获得对应积分，用户所获得积分价值与平台的价值挂钩，随着平台的用户与利润的增长，用户所持有的积分估值就越高，反之越低。



<-9.股东收益有哪些？->

平台每笔订单的利润 = 订单金额 - 商品成本 - 营销费用；营销费用主要包括团队上级和上上级的分佣，占利润总比例1%；然后每笔订单利润怎么分配呢？具体如下：原始股东占利润30%，节点股东30%，虚拟股东29%，平台运营奖金池10%；平台运营奖金池每天所盈余资金，将用于每天晚上7点钟现金抽奖活动，凡是今天有消费的用户均可参与抽奖。`;
    this.content = content
      .replace(/\<\-/g, "<div style='font-weight:bold;margin:10px 0 5px;'>")
      .replace(/\-\>/g, "</div>");
  }
};
</script>
<style lang="scss" scoped>
@import "~css/def";

.content {
  white-space: wrap;
  font-size: size(28);
  padding: 0 size(20);
  line-height: 1.2;
  text-align: justify;
}
</style>
