<template>
  <div class="rule">
    <top-head>产品使用说明</top-head>
    <div class="content">
      1.用户注册

      用户使用手机号码注册；为防止恶意注册，避免号贩子倒号现象，首先需要验证用户手机号码的真实性。系统会为用户手机上发送一个短信验证，验证通过后即可注册成功。

      2.为什么要绑定支付宝？

      平台对用户的现金奖励都是通过支付宝进行实时分账，包括平台抽奖游戏，营销奖励，销售奖励，团队奖励等等。

      3.商品价格波动的算法？

      价格每分钟变化。以1440分钟，即24小时为计算单元，之前1440分钟记为D1，再之前1440分钟记为D2，以此类推。当前分钟价格=D1价格*0.5*D1销量/D2销量，D2不可为0，初始值为1。参考价格：4～50元，不设上限。

      4.什么是平台股东？

      凡是在平台有成交记录的用户均为股东。

      5.什么是虚拟股东？

      所有股东中的贡献值排名前10%用户作为虚拟股东，虚拟股东每分钟变化。

      6.什么是贡献值？

      即价格*购买量。

      7.什么是节点股东？

      基本节点为贡献值前24位客户，可获得成为节点后贡献值的双倍积分。

      8.积分系统

      用户通过自己、下级以及下下级成交，或者通过分享转发能获得对应积分，用户所获得积分价值与平台的价值挂钩，随着平台的用户与利润的增长，用户所持有的积分估值就越高，反之越低。
    </div>
  </div>
</template>

<script>

export default {
  components: {},
  data() {
    return {

    };
  },
  methods: {

  },
  mounted() {

  },
}
</script>
<style lang='scss' scoped>
@import "~css/def";

.content {
  white-space: pre-line;
  font-size: size(28);
  padding: 0 size(20);
  line-height: 1.2;
}
</style>